--[[
<< تم برمجه وكتابه السورس من قبل مطور >>
<<         @sajadhassan          >>
]]
function run(msg, matches)
if msg.to.type == 'channel' and redis:get(boss..'group:add'..msg.to.id) then
if matches[1] == "الاوامر" then
if not is_mod(msg) then return "🚫~>انت لست ادمن" end
return [[
      ‌‌《 آلآوآمـر آلعآمـهہ‌‏》

🔱~> 《م1》 ~ آوآمـر آلآدآرهہ‌‏
⚙~> 《م2》 ~ آوآمـر آعدآدآت آلمـجمـوعهہ‌‏
🛡~> 《م3》~ آوآمـر آلحمـآيهہ‌‏
♻️~> 《م4》 ~ آلآوآمـر آلعآمـهہ‌‏
🕵‍♂~> 《م المطور》 ~ آوآمـر آلمـطـور
⚡️~> 《اوامر الرد》 ~ لآضـآفهہ‏‏ رد مـعين
📁~> 《اوامر الملفات》 ~ لآدآرهہ‏‏ مــلفآت آلبوت


🔊~> 《قناتنا 》
@aws_c9
 ]]
end
if matches[1]== 'م1' then
if not is_mod(msg) then return "🚫~>انت لست ادمن " end
local text =[[
💯~>《آوآمـر آلرفع وآلتنزيل 》
      
✔️~>《رفع عضو مميز~ تنزيل عضو مميز》
✔️~>《 رفع ادمن ~ تنزيل ادمن 》
✔️~>《رفع مدير ~ تنزيل مدير》
✔️~>《رفع منشئ ~ تنزيل منشئ》


🚷~>《 آوآمـر  كتم +آلحظـر+ وآلطـرد 》

🔞~>《منع+الكلمه》: لمنع كلمه
✔️~>《الغاء منع +الكلمه》 :لالغاء منع 
🚫~>《 كتم بالرد او معرف  》 : لكتم العضو
✔️~> 《الغاء كتم بالرد او معرف》 :لالغاء كتم عضو
❌~>《 طرد بالرد او معرف  》 : لطرد العضو 
🚯~>《 حظر بالرد او معرف 》 : لحظر وطرد العضو 
♻️~>《 الغاء الحظر بالرد او معرف 》 : لالغاء الحظر عن عضو 


قناتنا ~> @aws_c9
      
 ]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م2' then
if not is_mod(msg) then return "🚫~>انت لست ادمن " end
local text = [[

🔱~>《اوامر الوضع للمجموعه 》

  
📬~>《ضع اسم》~ لوضع اسم  
🙋‍♂~>《ضع ترحيب》 ~ لوضع ترحيب

⚒~>《الـرابـط 》~  لعرض الرابط  
🛠~>《ضع رابـط 》~ لوضع رابط

📬~>《اوامر  الاعدادات 》

🕵‍♂~>《المطور》 ~ لعرض معلومات المطور 
⚠️~> 《معلوماتي》 ~ لعرض معلوماتك  
🔰~>《الاعدادات》 ~ لعرض اعدادات المجموعه 
⚜~>《المجموعه 》~ لعرض معلومات المجموعه 
⚠️~>《القوانين》 ~ لعرض  القوانين 
👮‍♂~>《الادمنيه》 ~ لعرض  الادمنيه 
👨‍✈️~>《المدراء》 ~ لعرض  الاداريين 
🚷~>《المكتومين》 ~ لعرض  المكتومين 
⚔~>《الحمايه》 ~ لعرض كل الاعدادات  
🕹~>《الوسائط》 ~ لعرض اعدادات الميديا 

🌐~>《المجموعه》 ~ لعرض معلومات المجموعه 
📱~>《جهاتي》 ~ لمعرفة عدد الجهات التي أضفتها

 قناتنا ~> @aws_c9
 ]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م3' then
if not is_mod(msg) then return "🚫~>انت لست ادمن " end
local text = [[
✔️~>《اوامر حماية 》

🌀~> قفل ~ فتح : 《الروابط 》
🔈~> قفل ~ فتح :  《الصوت》
🎥 ~> قفل ~ فتح :  《الــفيديو》
🖼~> قفل ~ فتح :  《الـصــور》
🚫~> قفل ~ فتح :  《الملصقات》
🤖~> قفل ~ فتح : 《البوتات او البوتات بالطرد》
🗯~> ️قفل ~ فتح : 《المعرفات》
💮~> قفل ~ فتح :  《التوجيه》
📱~> قفل ~ فتح : 《الجهات 》
🗂~> قفل ~ فتح : 《الملفات》
⁉️~> قفل ~ فتح : 《الانلاين》
💯~> قفل ~ فتح : 《البصمات》
✔️~> قفل ~ فتح : 《الكل》
♻️~> قفل ~ فتح : 《التكرار》
📄~> قفل ~ فتح : 《الكلايش》
⚙~> قفل ~ فتح : 《التعديل》
💻~> قفل ~ فتح : 《الدردشه》

🔱~>《اوامر تفعيل》

🙋‍♂~> تفعيل ~ تعطيل : 《الترحيب》
🔊~> تفعيل ~ تعطيل : 《الردود》
🚯~> تفعيل ~ تعطيل : 《التحذير》
☑️~> تفعيل ~ تعطيل : 《الايدي》

 قناتنا ~> @aws_c9
 ]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م4' then
if not is_mod(msg) then return "🚫~>انت لست ادمن" end
local text = [[
📍💭 اوامر اضافيه 

🕵🏻 معلوماتك الشخصيه ⚙
📝~> 《اسمي》 : لعرض اسمك 💯
🌀~> 《معرفي》 : لعرض معرفك 💯
⚜~> 《ايدي+ايديي》 لعرض ايديك 💯
✔️~>《ايديه بالرد》لعرض ايدي العضو


 😁~> 《اوامر التحشيش 》

🚸~>《 تحب + اسم الشخص》
😽~>《بوس + (اسم الشخص》
🔊~>《كول + اسم الشخص》
📣~>《كله + الرد + كلمه》

 قناتنا ~> @aws_c9

 ]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "م المطور" then
if not is_sudo(msg) then return "🚫~>انت لست مطور" end
local text = [[
《اوامر المطور 🕵‍♂》


《 تفعيل 》 ~> لتفعيل البوت ✔️
《 تعطيل 》 ~> لتعطيل البوت ❌
 《اذاعه~ او~ اذاعه عام بالتوجيه ~ او~ اذاعه عام ~ او ~ اذاعه خاص 》 ~> لنشر كليشه 📄
 《مسح +المميزين+ الادمنيه +المدراء + المطورين》 لمسح وتنزيل 
 《اسم بوتك + غادر 》 ~> لمغادره بوت 
 《تحديث سورس》 ~> لتحديث ملفات بوت 
 


 قناتنا ~> @aws_c9


 ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'اوامر الرد' then
if not is_owner(msg) then return "🚫~>انت لست ادمن " end
local text = [[

~> 《جميع اوامر الردود 》

~> 《الردود》 ~ لعرض الردود المثبته
~> 《اضف رد》 ~ لأضافه رد جديد
~> 《مسح رد》~  الرد المراد مسحه
~> 《مسح الردود》 ~ لمسح كل الردود
~> 《اضف رد عام》 ~ لاضافه رد لكل المجموعات
~> 《مسح رد عام》 ~ لمسح الرد العام 
~> 《مسح الردود العامه》 ~ لمسح كل ردود العامه

قناتنا ~> @aws_c9

 ]]
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "اوامر الملفات" then
if not we_sudo(msg) then return "هذا الاوامر للمطور الاساسي فقط " end
local text = [[~>اوامر الملفات 

~> /p  《لعرض قائمه الملفات السورس 》
~> /p + 《اسم الملف المراد تفعيله 》
~> /p - 《اسم الملف المراد تعطيله 》
~> sp + 《الاسم | لارسال الملف اليك 》
~> dp + 《اسم الملف المراد حذفه 》
~> sp all | 《لارسالك كل ملفات السورس 》

قناتنا ~> @aws_c9
]]
return sendMsg(msg.to.id,1,text,'md')
end end 
if matches[1] == "سورس" or matches[1]=="السورس" then
return [[
   
🔱~>سورس بوبي
اقوى وافضل سورس على تليكرام ✔️

git clone https://github.com/bobe77/bobe.git;cd bobe;chmod +x ins;./ins

☑️~>لتنصيب سورس فقط اضغط على الكود ليتم نسخة
⚙~>ثم الصق كود في ترمنال وانتر وانتظر التنصيب 
⚙~>عند اكمال تنصيب سيطلب منك 
1-توكن بوت 
2-معرف المطور
3-اسم البوت 
⚙~> سوف يعمل بوت تلقائي

🔱~>قناة السورس 
@aws_c9

    ]]
end end
return{patterns = {"^(السورس)$","^(سورس)$","^(م المطور)$", "^(اوامر الرد)$", "^(اوامر الملفات)$", "^(الاوامر)$", "^(م1)$", "^(م2)$", "^(م3)$", "^(م4)$", }, run = run,}